{
    "topicId": "blockchain",
    "title": "Blockchain และ Cryptocurrencies",
    "sections": [
        {
            "title": "Cryptocurrency คืออะไร?",
            "content": "สื่อกลางในการแลกเปลี่ยน (Medium of Exchange) ที่ถูกสร้างและจัดเก็บในรูปแบบอิเล็กทรอนิกส์บน Blockchain โดยใช้การเข้ารหัส (Encryption) เพื่อความปลอดภัย",
            "keyPoints": [
                "Digital Money: จับต้องไม่ได้ แต่มีมูลค่า",
                "Peer-to-Peer: โอนโดยตรงไม่ต้องผ่านตัวกลาง (ธนาคาร)",
                "Physical Properties: เงินที่ดีต้องแบ่งหน่วยย่อยได้ (Divisible), หายาก (Scarce), ทนทาน (Durable), และเป็นที่ยอมรับ (Acceptable)"
            ]
        },
        {
            "title": "หลักการสำคัญ 3 ประการ",
            "content": "สิ่งที่ทำให้ Cryptocurrency แตกต่างจากเงินตราปกติ",
            "keyPoints": [
                "1. Decentralisation (การกระจายศูนย์): ไม่มีธนาคารกลางควบคุม ข้อมูลกระจายไปทุกเครื่อง",
                "2. Immutability (แก้ไขไม่ได้): เมื่อธุรกรรมถูกบันทึกลง Blockchain แล้ว จะไม่สามารถลบหรือแก้ไขได้",
                "3. Transparency (ความโปร่งใส): ทุกคนในเครือข่ายสามารถตรวจสอบประวัติธุรกรรมได้ทั้งหมด"
            ]
        },
        {
            "title": "ประเภทของ Wallet (กระเป๋าเงิน)",
            "content": "เครื่องมือสำหรับเก็บ Private Key เพื่อเข้าถึงเหรียญ",
            "keyPoints": [
                "Hardware Wallets: เก็บ Key ในอุปกรณ์คล้าย USB ปลอดภัยที่สุด (Cold Storage) เพราะไม่ต่อเน็ตตลอดเวลา",
                "Mobile Wallets: แอปบนมือถือ ใช้งานสะดวก แต่อาจเสี่ยงถ้ามือถือหาย",
                "Desktop Wallets: โปรแกรมบนคอมพิวเตอร์ ปลอดภัยระดับหนึ่งแต่เสี่ยงต่อไวรัส",
                "Cloud/Web Wallets: ฝากไว้กับเว็บ (เช่น Binance, Bitkub) สะดวกสุด แต่ Private Key อยู่ที่ผู้ให้บริการ (Third Party Risk)"
            ]
        },
        {
            "title": "Blockchain ทำงานอย่างไร?",
            "content": "Distributed Ledger Technology (บัญชีแยกประเภทแบบกระจาย)",
            "keyPoints": [
                "Map Transaction: ผู้ใช้สร้างธุรกรรมส่งเหรียญ",
                "Memory Pool (Mempool): ธุรกรรมรอการยืนยันอยู่ในคิว",
                "Broadcast: ประกาศธุรกรรมไปให้เครื่องขุด (Miners) ทราบ",
                "Verification: Miners แข่งกันแก้โจทย์คณิตศาสตร์ (Proof of Work)",
                "New Block: ผู้ชนะได้สิทธิ์สร้าง Block ใหม่และได้รับรางวัล (Block Reward)",
                "Chain: Block ใหม่ถูกต่อท้าย Block เดิมด้วยรหัส Hash ที่เชื่อมโยงกัน"
            ]
        },
        {
            "title": "Cryptocurrency Mining (การขุด)",
            "content": "กระบวนการยืนยันธุรกรรมและรักษาความปลอดภัยเครือข่าย",
            "keyPoints": [
                "Proof of Work (PoW): การลงแรงแก้โจทย์ (เช่น SHA-256 ใน Bitcoin) เพื่อยืนยันความถูกต้อง",
                "Halving: รางวัลจะลดลงครึ่งหนึ่งทุกๆ 210,000 Blocks (ประมาณ 4 ปี) - ปัจจุบัน 3.125 BTC",
                "Bitcoin Supply: มีจำกัดที่ 21 ล้านเหรียญ (คาดว่าจะขุดหมดในปี 2140)",
                "Mining Pools: การรวมพลังกันขุดเพื่อเพิ่มโอกาสได้รางวัลแล้วแบ่งกัน"
            ]
        },
        {
            "title": "DeFi (Decentralized Finance)",
            "content": "ระบบการเงินไร้ตัวกลาง ตัดธนาคารออกจากระบบ ใช้ Smart Contract ทำงานแทน",
            "keyPoints": [
                "DEX (Exchange): แลกเปลี่ยนเหรียญโดยตรง เช่น Uniswap",
                "Lending/Borrowing: กู้ยืมสินทรัพย์ดิจิทัล เช่น Compound",
                "Smart Contract: สัญญาอัตโนมัติที่ทำงานตามเงื่อนไขที่เขียนไว้ (Code is Law)"
            ]
        },
        {
            "title": "NFT (Non-Fungible Token)",
            "content": "สินทรัพย์ดิจิทัลที่มีเอกลักษณ์เฉพาะตัว ไม่สามารถทำซ้ำหรือทดแทนกันได้",
            "keyPoints": [
                "Fungible vs Non-Fungible: เงิน 100 บาทแทนกันได้ (Fungible) แต่ภาพวาด, ที่ดิน แทนกันไม่ได้",
                "Use Cases: งานศิลปะ (Digital Art), ใบปริญญา, โฉนดที่ดิน, ไอเทมเกม",
                "Famous NFT: 'The First 5000 Days' by Beeple (ขาย $69 ล้าน), Jack Dorsey's First Tweet ($2.9 ล้าน)"
            ]
        },
        {
            "title": "GameFi",
            "content": "การผนวกเกมเข้ากับการเงิน (Game + DeFi)",
            "keyPoints": [
                "Play-to-Earn: เล่นเกมแล้วสร้างรายได้จริง",
                "Ownership: ผู้เล่นเป็นเจ้าของไอเทมในเกมจริงๆ ในรูปแบบ NFT ซื้อขายได้"
            ]
        }
    ]
}