{
    "topicId": "iot",
    "title": "Internet of Things (IoT)",
    "sections": [
        {
            "title": "IoT คืออะไร? (Introduction)",
            "content": "IoT (Internet of Things) คือเครือข่ายของวัตถุ อุปกรณ์ พาหนะและสิ่งของต่างๆ ที่มีการฝังเซ็นเซอร์ ซอฟต์แวร์ และการเชื่อมต่อเครือข่าย ซึ่งทำให้วัตถุเหล่านี้สามารถเก็บรวบรวมและแลกเปลี่ยนข้อมูลกันได้ โดยไม่ต้องอาศัยการปฏิสัมพันธ์ระหว่างมนุษย์กับมนุษย์ หรือมนุษย์กับคอมพิวเตอร์",
            "keyPoints": [
                "**Definition**: Things (วัตถุ) + Smarter (ฉลาดขึ้น) + Connected (เชื่อมต่อกัน)",
                "**Concept**: 'Anytime, Anywhere, Any thing' เชื่อมต่อทุกเวลา ทุกสถานที่ ทุกสิ่ง",
                "**Goal**: เปลี่ยนจาก M2M (Machine to Machine) ธรรมดา ให้กลายเป็นเครือข่ายอัจฉริยะที่ช่วยการตัดสินใจของมนุษย์"
            ]
        },
        {
            "title": "สถาปัตยกรรม IoT (IoT Architecture)",
            "content": "โครงสร้างการทำงานของระบบ IoT โดยทั่วไปแบ่งเป็น 4 ชั้นหลัก",
            "keyPoints": [
                "**1. Sensing Layer (ชั้นรับข้อมูล)**: เซ็นเซอร์ต่างๆ เช่น วัดอุณหภูมิ, GPS, RFID ที่ทำหน้าที่เปลี่ยนค่าทางกายภาพเป็นสัญญาณดิจิทัล",
                "**2. Network Layer (ชั้นเครือข่าย)**: ช่องทางการสื่อสาร เช่น Wi-Fi, Bluetooth, 4G/5G, LoRaWAN เพื่อส่งข้อมูลไปยัง Cloud",
                "**3. Data Processing Layer (ชั้นประมวลผล)**: Cloud Computing หรือ Edge Computing ที่ทำหน้าที่จัดเก็บและวิเคราะห์ข้อมูลจำนวนมหาศาล",
                "**4. Application Layer (ชั้นประยุกต์ใช้งาน)**: ส่วนติดต่อผู้ใช้ (User Interface) เช่น Mobile App หรือ Dashboard แสดผล"
            ]
        },
        {
            "title": "โปรโตคอลการสื่อสาร (Communication Protocols)",
            "content": "ภาษาที่อุปกรณ์ IoT ใช้คุยกัน ซึ่งต้องเบาและประหยัดพลังงาน",
            "keyPoints": [
                "**MQTT (Message Queuing Telemetry Transport)**: โปรโตคอลยอดนิยม ใช้หลักการ Publisher/Subscriber เหมาะกับเน็ตช้าและอุปกรณ์พลังงานต่ำ",
                "**CoAP (Constrained Application Protocol)**: คล้าย HTTP แต่ใช้ UDP ออกแบบมาสำหรับ Node ขนาดเล็กมาก",
                "**HTTP/HTTPS**: ใช้ส่งข้อมูลขนาดใหญ่ แต่อาจกินทรัพยากรมากเกินไปสำหรับอุปกรณ์เล็กๆ",
                "**ZigBee / Z-Wave**: มาตรฐานไร้สายระยะสั้นแบบ Mesh Network นิยมใช้ใน Smart Home"
            ]
        },
        {
            "title": "ประวัติและความเป็นมา (History)",
            "content": "จากตู้โค้กสู่โลกที่เชื่อมต่อกันหมด",
            "keyPoints": [
                "**1982 (The First IoT Device)**: ตู้ขายโค้กที่มหาวิทยาลัย Carnegie Mellon ที่ต่อเน็ตเพื่อเช็คว่าของหมดหรือยังและเย็นแค่ไหน",
                "**1990**: John Romkey สร้าง 'เครื่องปิ้งขนมปัง' เครื่องแรกที่เปิด-ปิดผ่านอินเทอร์เน็ตได้",
                "**1999**: Kevin Ashton เสนอคำว่า 'Internet of Things' ครั้งแรกในโครงการ RFID ของบริษัท P&G",
                "**2000**: LG เปิดตัวตู้เย็นอัจฉริยะเครื่องแรก",
                "**2008-2009**: จุดเปลี่ยนสำคัญเมื่อจำนวนอุปกรณ์ที่ต่อเน็ตมีมากกว่าจำนวนประชากรโลก"
            ]
        },
        {
            "title": "การประยุกต์ใช้ในบ้าน (Smart Home)",
            "content": "เปลี่ยนบ้านธรรมดาให้เป็นบ้านอัจฉริยะ",
            "keyPoints": [
                "**Security**: กล้อง CCTV, Smart Lock ปลดล็อคด้วยใบหน้า/ลายนิ้วมือ",
                "**Convenience**: หลอดไฟเปลี่ยนสีได้ (Smart Bulb), ม่านเปิด-ปิดอัตโนมัติ, หุ่นยนต์ดูดฝุ่น",
                "**Energy Saving**: แอร์ที่ปรับอุณหภูมิตามจำนวนคน, ปลั๊กไฟที่ตัดไฟเมื่อไม่ใช้",
                "**Voice Assistants**: สั่งงานด้วยเสียงผ่าน Google Home, Amazon Alexa"
            ]
        },
        {
            "title": "Smart Farming (เกษตรอัจฉริยะ)",
            "content": "Precision Farming การเกษตรแม่นยำสูง",
            "keyPoints": [
                "**Soil Monitoring**: เซ็นเซอร์วัด N-P-K และความชื้นในดิน เพื่อรดน้ำและใส่ปุ๋ยเฉพาะจุดที่ขาด",
                "**Drones**: บินสำรวจสภาพไร่, พ่นยาฆ่าแมลงจุดที่ระบาด, ถ่ายภาพ Multispectral วิเคราะห์สุขภาพพืช",
                "**Smart Greenhouse**: โรงเรือนที่ปรับอุณหภูมิและความชื้นอัตโนมัติ",
                "**Livestock Tracking**: ปลอกคอ animals ติดตามตำแหน่งและสุขภาพสัตว์"
            ]
        },
        {
            "title": "Industrial IoT (IIoT)",
            "content": "IoT ในภาคอุตสาหกรรม (Industry 4.0)",
            "keyPoints": [
                "**Predictive Maintenance**: เซ็นเซอร์วัดการสั่นสะเทือนของเครื่องจักร เพื่อทำนายว่ามอเตอร์จะพังเมื่อไหร่ ก่อนที่จะเสียจริง",
                "**Asset Tracking**: ติดตามตำแหน่งสินค้าและพัสดุในโกดังแบบ Real-time",
                "**Digital Twin**: การสร้างแบบจำลอง 3 มิติของโรงงานเพื่อจำลองสถานการณ์ก่อนผลิตจริง"
            ]
        },
        {
            "title": "ความท้าทายและความปลอดภัย (Challenges & Security)",
            "content": "ความเสี่ยงที่มาพร้อมความสะดวกสบาย",
            "keyPoints": [
                "**Privacy**: ข้อมูลส่วนตัว (เช่น กล้องในบ้าน) อาจหลุดออกไป",
                "**Security Attacks**: อุปกรณ์ IoT มักมีระบบป้องกันต่ำ เป็นเป้าหมายของ DDoS Attack (เช่น Mirai Botnet)",
                "**Interoperability**: ปัญหาอุปกรณ์ต่างยี่ห้อคุยกันไม่รู้เรื่อง (มาตรฐานไม่ตรงกัน)",
                "**Energy**: การทำให้อุปกรณ์ทำงานได้นานหลายปีด้วยแบตเตอรี่ก้อนเดียว"
            ]
        }
    ]
}