{
    "topicId": "quantum",
    "title": "Quantum Computing",
    "sections": [
        {
            "title": "Quantum Computing คืออะไร?",
            "content": "การประมวลผลรูปแบบใหม่ที่ใช้หลักการของกลศาสตร์ควอนตัม (Quantum Mechanics) ในการคำนวณ ซึ่งแตกต่างจากคอมพิวเตอร์ดั้งเดิม (Classical Computer) อย่างสิ้นเชิง",
            "keyPoints": [
                "**Classical Bit**: หน่วยข้อมูลพื้นฐานมีค่าเป็น 0 หรือ 1 อย่างใดอย่างหนึ่ง",
                "**Quantum Bit (Qubit)**: หน่วยข้อมูลที่สามารถเป็นทั้ง 0 และ 1 ได้ในเวลาเดียวกัน (Superposition)",
                "**Exponential Power**: พลังประมวลผลเพิ่มขึ้นแบบทวีคูณตามจำนวน Qubit (2^n) ในขณะที่คอมฯ ทั่วไปเพิ่มแบบเส้นตรง"
            ]
        },
        {
            "title": "หลักการควอนตัม (Quantum Phenomena)",
            "content": "2 ปรากฏการณ์มหัศจรรย์ที่ทำให้ Quantum Computer ทรงพลัง",
            "keyPoints": [
                "**Superposition (การซ้อนทับ)**: สภาวะที่ Qubit สามารถ 'อยู่ทุกสถานะพร้อมกัน' ได้ จนกว่าจะถูกวัดค่า เปรียบเหมือนเหรียญที่กำลังหมุนอยู่ (ออกได้ทั้งหัวและก้อย)",
                "**Entanglement (การพัวพัน)**: การเชื่อมโยง Qubit คู่หนึ่งเข้าด้วยกัน โดยที่สถานะของตัวหนึ่งจะส่งผลต่ออีกตัวทันที แม้จะอยู่ห่างกันคนละซีกจักรวาล (Einstein เรียกว่า 'Spooky action at a distance')"
            ]
        },
        {
            "title": "Hardware Technologies",
            "content": "เทคโนโลยีการสร้าง Qubit ในปัจจุบัน",
            "keyPoints": [
                "**Superconducting Qubits**: ใช้สรจจรไฟฟ้าตัวนำยิ่งยวดที่เย็นจัด (ใกล้ 0 Kelvin) - พัฒนาโดย IBM, Google (Sycamore)",
                "**Trapped Ion**: ใช้สนามแม่เหล็กไฟฟ้ากักขังไอออนไว้ในสุญญากาศ - พัฒนาโดย IonQ, Honeywell",
                "**Photonic Qubits**: ใช้แสง (Photon) ในการประมวลผล - พัฒนาโดย Xanadu"
            ]
        },
        {
            "title": "Why Now? (ทำไมต้องสนใจ)",
            "content": "ขีดจำกัดของคอมพิวเตอร์ปัจจุบัน (Moore's Law กำลังจะตัน)",
            "keyPoints": [
                "**Simulation**: คอมฯ ปัจจุบันจำลองโมเลกุลยาที่ซับซ้อนไม่ได้ แต่ Quantum ทำได้ตามธรรมชาติ",
                "**optimization**: การแก้ปัญหาที่มีทางเลือกเป็นล้านล้านรูปแบบ (เช่น เส้นทางขนส่ง, ตารางบิน) Quantum หาคำตอบได้เร็วกว่ามาก"
            ]
        },
        {
            "title": "Quantum Supremacy",
            "content": "จุดที่ Quantum Computer สามารถคำนวณโจทย์ที่ Supercomputer ที่เก่งที่สุดในโลกใช้เวลาหมื่นปี ให้เสร็จได้ในไม่กี่นาที",
            "keyPoints": [
                "**Google (2019)**: ชิป Sycamore 53 Qubits ทำงานเสร็จใน 200 วินาที (เทียบกับ Supercomputer ที่ต้องใช้ 10,000 ปี)",
                "**IBM & Others**: ยุคปัจจุบันอยู่ในช่วง NISQ (Noisy Intermediate-Scale Quantum) คือ Qubit ยังมี Error เยอะ ต้องพัฒนาระบบ Error Correction ต่อไป"
            ]
        },
        {
            "title": "Impact & Risks (ผลกระทบ)",
            "content": "ดาบสองคมของเทคโนโลยี",
            "keyPoints": [
                "**Cryptography Crisis**: Quantum Computer สามารถถอดรหัส (Encryption) ที่ใช้กันทั้งโลกในปัจจุบัน (RSA) ได้ในพริบตา (Shor's Algorithm)",
                "**Quantum Safe**: โลกกำลังเร่งพัฒนามาตรฐาน PQC (Post-Quantum Cryptography) เพื่อป้องกันข้อมูลก่อน Quantum จะมาถึงอย่างสมบูรณ์"
            ]
        }
    ]
}