{
    "topicId": "quantum",
    "title": "Quantum Computing",
    "sections": [
        {
            "title": "Quantum Computing คืออะไร?",
            "content": "รูปแบบการประมวลผลใหม่ที่ไม่ได้ใช้แค่ 0 หรือ 1 แบบคอมพิวเตอร์ทั่วไป แต่ใช้หลักการทางควอนตัมฟิสิกส์",
            "keyPoints": [
                "Beyond Bits: เปลี่ยนจาก Bits (0 หรือ 1) เป็น Qubits (0, 1 หรือทั้งสองอย่างพร้อมกัน)",
                "Comparison: Computer ทั่วไปเหมือนสวิตช์ไฟ (เปิด/ปิด) แต่ Quantum เหมือนสวิตช์หรี่ไฟ (Dimmer) ที่อยู่ได้หลายสถานะ",
                "Power: 3 Qubits เก็บข้อมูลได้ 8 สถานะพร้อมกัน (2^N) พลังประมวลผลเพิ่มขึ้นแบบทวีคูณ"
            ]
        },
        {
            "title": "ปรากฏการณ์ควอนตัม (Key Phenomena)",
            "content": "2 หัวใจหลักที่ทำให้ Quantum Computer ทรงพลัง",
            "keyPoints": [
                "Superposition (การซ้อนทับ): ความสามารถที่ Qubit จะเป็นทั้ง 0 และ 1 พร้อมกันได้ จนกว่าจะถูกวัดผล (Measurement)",
                "Entanglement (การพัวพัน): ความสัมพันธ์พิเศษของคู่ Qubit แม้จะอยู่ห่างคนละซีกโลก ถ้าวัดค่าตัวหนึ่ง อีกตัวจะรู้ผลทันที (เหมือนเหรียญวิเศษที่โยนออกหัว-ก้อยตรงข้ามกันเสมอ)"
            ]
        },
        {
            "title": "การทำงาน (How it computes)",
            "content": "ความแตกต่างระหว่างการทำงานแบบขนานและแบบลำดับ",
            "keyPoints": [
                "Classical (Sequential): เหมือนหุ่นยนต์เดินหาทางออกเขาวงกตทีละเส้นทาง",
                "Quantum (Parallel): เหมือนหุ่นยนต์แยกร่างเดินทุกเส้นทางพร้อมกันเพื่อหาทางออกที่ดีที่สุด",
                "Analogy: การแกะสลักภูมิทัศน์ความน่าจะเป็น (Sculpting Probability) ให้คำตอบที่ถูกต้องเป็นหลุมลึกที่สุดที่น้ำจะไหลไปรวมกัน"
            ]
        },
        {
            "title": "ความท้าทาย (Challenges)",
            "content": "ทำไมเรายังไม่เห็น Quantum Computer ทั่วไปตามบ้าน?",
            "keyPoints": [
                "Fragile Qubits: Qubits เปราะบางมาก ถูกรบกวนง่ายจากความร้อน/แสง",
                "Decoherence: การสูญเสียสถานะควอนตัมอย่างรวดเร็ว",
                "Isolation: ต้องทำงานในอุณหภูมิเย็นจัด (ใกล้ 0 องศาสัมบูรณ์) และสุญญากาศ",
                "Error Correction: การแก้ไขข้อผิดพลาดทำได้ยากมาก",
                "NISQ Era: ยุคปัจจุบันเรียกว่า Noisy Intermediate-Scale Quantum (มีเสียงรบกวน, จำนวน Qubit ยังน้อย)"
            ]
        },
        {
            "title": "การประยุกต์ใช้ (Applications)",
            "content": "Quantum Computer เหมาะกับงานที่ซับซ้อนเกินกว่า Supercomputer จะทำไหว",
            "keyPoints": [
                "Materials Science: จำลองโครงสร้างโมเลกุลยาใหม่ๆ หรือวัสดุศาสตร์",
                "Optimization: การจัดเส้นทางขนส่ง, การเงิน, จราจร ที่มีตัวแปรมหาศาล",
                "Cryptography: สามารถถอดรหัสลับปัจจุบันได้ (Shor's Algorithm) จึงต้องพัฒนา Quantum-Safe Encryption",
                "AI/ML: ประมวลผล Pattern ข้อมูลมหาศาลได้เร็วกว่าเดิมมาก"
            ]
        }
    ]
}